In [53]:
# Updating Rows and Columns - Modifying Data within DataFrames

In [54]:
people = {
    "first_name": ["Corey", "Jane", "John"],
    "last_name": ["Schafer", "Doe", "Doe"],
    "email": ["coreymschafer@email.com", "janedoe@email.com", "johndoe@email.com"]
}

In [55]:
import pandas as pd

In [56]:
df = pd.DataFrame(people)

In [57]:
df

  first_name last_name                    email
0      Corey   Schafer  coreymschafer@email.com
1       Jane       Doe        janedoe@email.com
2       John       Doe        johndoe@email.com

In [58]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [59]:
#df.columns = ['first', 'last', 'email']
#df

In [60]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  coreymschafer@email.com
1       Jane       Doe        janedoe@email.com
2       John       Doe        johndoe@email.com

In [61]:
df.columns = df.columns.str.replace(' ', '_')

In [68]:
df.rename(columns={'first_name':'First_Name', 'last_name':'Last_Name', 'email':'Email'}, inplace=True)
df

  First_Name Last_Name                    Email
0      Corey   Schafer  coreymschafer@email.com
1       Jane       Doe        janedoe@email.com
2       John       Doe        johndoe@email.com

In [63]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  coreymschafer@email.com
1       Jane       Doe        janedoe@email.com
2       John       Doe        johndoe@email.com